Tekla.Structures.Drawing.Exceptions.ThrowNewException(Tekla.Structures.Drawing.Exceptions.ExceptionTypes)
The exception to throw for each ExceptionType
Exception:

Tekla.Structures.Drawing.Exceptions.CheckMinimalExportValues(Tekla.Structures.DrawingInternal.QueryTypeEnum,System.Int32,System.Int32,System.Int32,System.Boolean)
Call this function from your Export function.
It checks the basic information.